[
  {
    "id": 1,
    "level": "junior",
    "question": "What are the main components of an Android application?",
    "short_answer": "Activities, Services, Broadcast Receivers, and Content Providers.",
    "look_for": "Understanding of the four fundamental building blocks and ability to briefly explain what each does."
  },
  {
    "id": 2,
    "level": "junior",
    "question": "Explain the Android Activity lifecycle.",
    "short_answer": "onCreate() → onStart() → onResume() → onPause() → onStop() → onDestroy(). The activity goes through these states as users interact with it.",
    "look_for": "Knowledge of the basic lifecycle methods and when they're called, especially onCreate, onResume, onPause."
  },
  {
    "id": 3,
    "level": "junior",
    "question": "What is the difference between LinearLayout and RelativeLayout?",
    "short_answer": "LinearLayout arranges views in a single direction (horizontal or vertical), while RelativeLayout positions views relative to each other or the parent.",
    "look_for": "Basic understanding of layout managers and when to use each one for simple UI designs."
  },
  {
    "id": 4,
    "level": "junior",
    "question": "What is an Intent in Android?",
    "short_answer": "An Intent is a messaging object used to request an action from another app component, like starting an activity or service.",
    "look_for": "Understanding of explicit vs implicit intents and ability to give a simple example."
  },
  {
    "id": 5,
    "level": "junior",
    "question": "What is the AndroidManifest.xml file?",
    "short_answer": "A configuration file that describes essential information about the app including components, permissions, and minimum API level.",
    "look_for": "Knowledge that it declares activities, permissions, and app metadata."
  },
  {
    "id": 6,
    "level": "junior",
    "question": "What is the difference between View and ViewGroup?",
    "short_answer": "View is a basic UI component (like Button, TextView), while ViewGroup is a container that holds other Views (like LinearLayout, ConstraintLayout).",
    "look_for": "Understanding of the UI hierarchy and that ViewGroup extends View."
  },
  {
    "id": 7,
    "level": "junior",
    "question": "How do you handle button clicks in Android?",
    "short_answer": "Implement OnClickListener interface or use lambda expressions with setOnClickListener() method.",
    "look_for": "Practical knowledge of event handling and at least one approach to implementing click listeners."
  },
  {
    "id": 8,
    "level": "junior",
    "question": "What is R.java file in Android?",
    "short_answer": "An auto-generated file that contains resource IDs for all resources in the res/ folder.",
    "look_for": "Understanding that it's auto-generated and shouldn't be modified manually."
  },
  {
    "id": 9,
    "level": "junior",
    "question": "What is the difference between dp and px?",
    "short_answer": "dp (density-independent pixels) scales with screen density, while px (pixels) is absolute. Use dp for layouts to support different screen sizes.",
    "look_for": "Understanding of screen density and why dp is preferred for responsive design."
  },
  {
    "id": 10,
    "level": "junior",
    "question": "What is a Toast in Android?",
    "short_answer": "A Toast is a small popup message that appears briefly to provide feedback to the user.",
    "look_for": "Knowledge of when to use Toast vs Snackbar, understanding of duration settings."
  },
  {
    "id": 11,
    "level": "junior",
    "question": "What is the difference between match_parent and wrap_content?",
    "short_answer": "match_parent makes a view as large as its parent, while wrap_content sizes the view to fit its content.",
    "look_for": "Basic understanding of layout parameters and how they affect view sizing."
  },
  {
    "id": 12,
    "level": "junior",
    "question": "What is an Adapter in Android?",
    "short_answer": "An Adapter acts as a bridge between data and UI components like ListView or RecyclerView, converting data into views.",
    "look_for": "Understanding of the adapter pattern and familiarity with common adapters like ArrayAdapter."
  },
  {
    "id": 13,
    "level": "junior",
    "question": "What is ADB?",
    "short_answer": "Android Debug Bridge (ADB) is a command-line tool for communicating with Android devices for debugging and development.",
    "look_for": "Knowledge of basic ADB commands like install, logcat, shell."
  },
  {
    "id": 14,
    "level": "junior",
    "question": "What is Gradle in Android?",
    "short_answer": "Gradle is the build system for Android that compiles code, manages dependencies, and packages the app.",
    "look_for": "Basic understanding of build.gradle files and dependency management."
  },
  {
    "id": 15,
    "level": "junior",
    "question": "What is the difference between implicit and explicit intents?",
    "short_answer": "Explicit intents specify the exact component to start, while implicit intents declare an action for any app to handle.",
    "look_for": "Ability to provide examples of each, understanding of intent filters."
  },
  {
    "id": 16,
    "level": "junior",
    "question": "What is a Bundle in Android?",
    "short_answer": "A Bundle is a key-value container used to pass data between activities or save instance state.",
    "look_for": "Knowledge of common data types that can be stored and how to retrieve them."
  },
  {
    "id": 17,
    "level": "junior",
    "question": "What is the purpose of the res folder?",
    "short_answer": "The res folder contains all non-code resources like layouts, images, strings, and colors.",
    "look_for": "Understanding of different resource folders (drawable, layout, values) and resource qualifiers."
  },
  {
    "id": 18,
    "level": "junior",
    "question": "What is a ContentProvider?",
    "short_answer": "ContentProvider manages shared app data that other apps can query or modify through a consistent interface.",
    "look_for": "Basic understanding of data sharing between apps and content URIs."
  },
  {
    "id": 19,
    "level": "junior",
    "question": "What is ANR in Android?",
    "short_answer": "Application Not Responding (ANR) occurs when the UI thread is blocked for too long (5+ seconds).",
    "look_for": "Understanding that long operations should be moved off the main thread."
  },
  {
    "id": 20,
    "level": "junior",
    "question": "What is the difference between onCreate() and onStart()?",
    "short_answer": "onCreate() is called once when the activity is first created. onStart() is called when the activity becomes visible to the user.",
    "look_for": "Understanding that onCreate happens once, while onStart can be called multiple times."
  },
  {
    "id": 21,
    "level": "junior",
    "question": "What is Logcat?",
    "short_answer": "Logcat is Android's logging system that displays system messages, including stack traces, log messages from your app, and system services.",
    "look_for": "Familiarity with log levels (Verbose, Debug, Info, Warn, Error) and filtering."
  },
  {
    "id": 22,
    "level": "junior",
    "question": "What is a Snackbar?",
    "short_answer": "Snackbar is a lightweight feedback message that appears at the bottom of the screen, can include an action, and dismisses after a timeout or user action.",
    "look_for": "Understanding of when to use Snackbar vs Toast or Dialog."
  },
  {
    "id": 23,
    "level": "junior",
    "question": "What is the difference between String and StringBuilder?",
    "short_answer": "String is immutable (cannot be changed after creation). StringBuilder is mutable and more efficient for string concatenation in loops.",
    "look_for": "Understanding of immutability and performance implications."
  },
  {
    "id": 24,
    "level": "junior",
    "question": "What is SharedPreferences?",
    "short_answer": "SharedPreferences stores small amounts of primitive data as key-value pairs in a file, persisting across app sessions.",
    "look_for": "Knowledge of when to use SharedPreferences vs database, understanding of commit vs apply."
  },
  {
    "id": 25,
    "level": "junior",
    "question": "What is the difference between finish() and finishAffinity()?",
    "short_answer": "finish() closes the current activity. finishAffinity() closes the current activity and all activities in the same task affinity below it.",
    "look_for": "Basic understanding of activity stack and task management."
  },
  {
    "id": 26,
    "level": "junior",
    "question": "What is ConstraintLayout?",
    "short_answer": "ConstraintLayout is a flexible layout that allows you to create complex layouts with a flat view hierarchy by positioning views relative to each other or parent.",
    "look_for": "Understanding of constraints, chains, and guidelines for responsive design."
  },
  {
    "id": 27,
    "level": "junior",
    "question": "What is an AlertDialog?",
    "short_answer": "AlertDialog is a modal dialog that can display a title, message, and up to three buttons for user interaction.",
    "look_for": "Knowledge of dialog builder pattern and handling button clicks."
  },
  {
    "id": 28,
    "level": "junior",
    "question": "What is the difference between Visibility.GONE and Visibility.INVISIBLE?",
    "short_answer": "INVISIBLE hides the view but still takes up space in the layout. GONE hides the view and removes it from the layout, taking up no space.",
    "look_for": "Understanding of layout impact and when to use each."
  },
  {
    "id": 29,
    "level": "junior",
    "question": "What is a BroadcastReceiver?",
    "short_answer": "A component that responds to system-wide broadcast announcements like battery low, network changes, or custom broadcasts from your app.",
    "look_for": "Understanding of registering receivers statically vs dynamically."
  },
  {
    "id": 30,
    "level": "junior",
    "question": "What is the purpose of onResume() method?",
    "short_answer": "onResume() is called when the activity is about to start interacting with the user. It's where you should start animations, resume paused tasks, or refresh content.",
    "look_for": "Understanding of when activity becomes visible vs interactive."
  },
  {
    "id": 31,
    "level": "junior",
    "question": "What is the difference between Service and Activity?",
    "short_answer": "Activity provides a UI for user interaction. Service runs in the background without a UI for long-running operations.",
    "look_for": "Understanding of when to use each component."
  },
  {
    "id": 32,
    "level": "junior",
    "question": "What is findViewById()?",
    "short_answer": "findViewById() is a method to get a reference to a View from XML layout by its ID.",
    "look_for": "Understanding of type casting and that ViewBinding is now preferred."
  },
  {
    "id": 33,
    "level": "junior",
    "question": "What is the main thread in Android?",
    "short_answer": "The main thread (UI thread) handles all UI updates and user interactions. Long operations should not run on it to avoid ANR.",
    "look_for": "Understanding of threading and why to keep main thread responsive."
  },
  {
    "id": 34,
    "level": "junior",
    "question": "What is the difference between a Fragment and an Activity?",
    "short_answer": "Activity represents a full screen with UI. Fragment is a reusable portion of UI that must be hosted in an Activity or another Fragment.",
    "look_for": "Basic understanding of fragments as modular UI components."
  },
  {
    "id": 35,
    "level": "junior",
    "question": "What is a PendingIntent?",
    "short_answer": "PendingIntent is a token that you give to another application to perform an action on your app's behalf with your permissions.",
    "look_for": "Understanding of use cases like notifications and alarm manager."
  },
  {
    "id": 36,
    "level": "junior",
    "question": "What is the difference between margin and padding?",
    "short_answer": "Margin is the space outside a view's border. Padding is the space inside a view's border between the border and content.",
    "look_for": "Visual understanding of layout spacing."
  },
  {
    "id": 37,
    "level": "junior",
    "question": "What is onDestroy() method?",
    "short_answer": "onDestroy() is the final lifecycle callback before an activity is destroyed, used for cleanup like closing resources.",
    "look_for": "Understanding of cleanup responsibilities and when it's called."
  },
  {
    "id": 38,
    "level": "junior",
    "question": "What is a Drawable in Android?",
    "short_answer": "Drawable is a general abstraction for something that can be drawn, like bitmaps, shapes, colors, or vector graphics.",
    "look_for": "Knowledge of different drawable types (BitmapDrawable, VectorDrawable, ShapeDrawable)."
  },
  {
    "id": 39,
    "level": "junior",
    "question": "What is the difference between ArrayList and Array?",
    "short_answer": "Array has fixed size and can hold primitives or objects. ArrayList is dynamic, can only hold objects, and provides more methods.",
    "look_for": "Understanding of when to use each based on size requirements."
  },
  {
    "id": 40,
    "level": "junior",
    "question": "What is a ViewHolder pattern?",
    "short_answer": "ViewHolder pattern caches view references to avoid repeatedly calling findViewById(), improving list scrolling performance.",
    "look_for": "Understanding of performance benefits and use in RecyclerView."
  },
  {
    "id": 41,
    "level": "junior",
    "question": "What is the difference between == and .equals() in Java/Kotlin?",
    "short_answer": "== compares object references (same object in memory). .equals() compares object contents/values.",
    "look_for": "Understanding of reference vs value equality."
  },
  {
    "id": 42,
    "level": "junior",
    "question": "What is an AsyncTask?",
    "short_answer": "AsyncTask is a deprecated helper class for running short background operations and updating UI, now replaced by coroutines or RxJava.",
    "look_for": "Awareness that it's deprecated and knowledge of modern alternatives."
  },
  {
    "id": 43,
    "level": "junior",
    "question": "What is the purpose of onPause() method?",
    "short_answer": "onPause() is called when the activity is partially obscured or about to lose focus. Used to pause animations, save persistent data.",
    "look_for": "Understanding of when to save state and release resources."
  },
  {
    "id": 44,
    "level": "junior",
    "question": "What is a Notification in Android?",
    "short_answer": "Notification is a message displayed in the notification drawer to alert users about app events or updates.",
    "look_for": "Knowledge of notification channels and importance levels."
  },
  {
    "id": 45,
    "level": "junior",
    "question": "What is the difference between Foreground and Background Service?",
    "short_answer": "Foreground service shows a persistent notification and is less likely to be killed. Background service runs without notification.",
    "look_for": "Understanding of when to use foreground service (music, navigation)."
  },
  {
    "id": 46,
    "level": "junior",
    "question": "What is a MenuInflater?",
    "short_answer": "MenuInflater inflates menu XML resources into Menu objects for options menus, context menus, or popup menus.",
    "look_for": "Understanding of how to create and handle menu items."
  },
  {
    "id": 47,
    "level": "junior",
    "question": "What is the difference between val and var in Kotlin?",
    "short_answer": "val is immutable (read-only, like final in Java). var is mutable and can be reassigned.",
    "look_for": "Understanding of immutability and preference for val when possible."
  },
  {
    "id": 48,
    "level": "junior",
    "question": "What is a ContentResolver?",
    "short_answer": "ContentResolver provides access to content from ContentProviders, allowing you to query, insert, update, or delete data.",
    "look_for": "Basic understanding of content provider interaction."
  },
  {
    "id": 49,
    "level": "junior",
    "question": "What is the application class in Android?",
    "short_answer": "Application class is the base class that maintains global application state, created before any other component.",
    "look_for": "Understanding of when to use for singletons and initialization."
  },
  {
    "id": 50,
    "level": "junior",
    "question": "What is a ScrollView?",
    "short_answer": "ScrollView is a layout container that allows content to be scrolled vertically when it exceeds screen height.",
    "look_for": "Knowledge that it should have only one direct child and limitations with RecyclerView."
  },
  {
    "id": 51,
    "level": "mid",
    "question": "Explain the difference between Serializable and Parcelable.",
    "short_answer": "Both pass objects between components. Parcelable is Android-specific and faster, while Serializable is Java standard but slower.",
    "look_for": "Understanding of performance differences and when to use each."
  },
  {
    "id": 52,
    "level": "mid",
    "question": "What is the difference between Service and IntentService?",
    "short_answer": "Service runs on the main thread. IntentService automatically runs tasks on a background thread and stops itself when done.",
    "look_for": "Understanding of threading implications and that IntentService is now deprecated."
  },
  {
    "id": 53,
    "level": "mid",
    "question": "Explain Android's memory management.",
    "short_answer": "Android uses ART runtime with garbage collection. Each app runs in its own process with limited heap size. System can kill background processes when memory is low.",
    "look_for": "Understanding of memory limitations, knowledge of memory leaks, familiarity with profiling tools."
  },
  {
    "id": 54,
    "level": "mid",
    "question": "What are Fragments and why use them?",
    "short_answer": "Fragments are reusable UI portions with their own lifecycle. They allow modular screen designs and tablet optimization.",
    "look_for": "Understanding of Fragment lifecycle and FragmentManager."
  },
  {
    "id": 55,
    "level": "mid",
    "question": "Explain different types of Context in Android.",
    "short_answer": "Application Context (app lifetime), Activity Context (activity lifetime), and Service Context. Use appropriately to avoid memory leaks.",
    "look_for": "Understanding of context lifetime and memory leak risks."
  },
  {
    "id": 56,
    "level": "mid",
    "question": "What is RecyclerView and how does it differ from ListView?",
    "short_answer": "RecyclerView is a flexible list view with built-in ViewHolder pattern, layout managers, and item animations. More efficient than ListView.",
    "look_for": "Understanding of ViewHolder pattern and knowledge of LayoutManager types."
  },
  {
    "id": 57,
    "level": "mid",
    "question": "Explain the MVVM architecture pattern.",
    "short_answer": "Model-View-ViewModel separates UI (View), business logic (ViewModel), and data (Model). ViewModel survives configuration changes.",
    "look_for": "Practical experience implementing MVVM and knowledge of LiveData/StateFlow."
  },
  {
    "id": 58,
    "level": "mid",
    "question": "What is LiveData?",
    "short_answer": "LiveData is an observable data holder that's lifecycle-aware, automatically updating UI components when data changes.",
    "look_for": "Understanding of lifecycle awareness and when to use LiveData vs StateFlow."
  },
  {
    "id": 59,
    "level": "mid",
    "question": "What is ViewModel and why use it?",
    "short_answer": "ViewModel stores and manages UI-related data that survives configuration changes like screen rotations.",
    "look_for": "Understanding of ViewModel lifecycle and scope, knowledge of ViewModelProvider."
  },
  {
    "id": 60,
    "level": "mid",
    "question": "What is Room database?",
    "short_answer": "Room is an abstraction layer over SQLite that provides compile-time verification of SQL queries and simplifies database operations.",
    "look_for": "Knowledge of Entity, DAO, and Database components, understanding of database migrations."
  },
  {
    "id": 61,
    "level": "mid",
    "question": "What is the difference between ArrayList and LinkedList?",
    "short_answer": "ArrayList uses dynamic array (fast random access). LinkedList uses doubly-linked list (faster insertion/deletion).",
    "look_for": "Understanding of time complexity and choosing appropriate data structure."
  },
  {
    "id": 62,
    "level": "mid",
    "question": "What is Retrofit?",
    "short_answer": "Retrofit is a type-safe HTTP client for Android that simplifies REST API calls and handles JSON parsing.",
    "look_for": "Experience with API integration, knowledge of converters and interceptors."
  },
  {
    "id": 63,
    "level": "mid",
    "question": "What is the difference between AsyncTask and Coroutines?",
    "short_answer": "AsyncTask is deprecated and runs on background threads with complex lifecycle. Coroutines are lightweight, simpler, and provide structured concurrency.",
    "look_for": "Understanding that AsyncTask is deprecated and preference for modern alternatives."
  },
  {
    "id": 64,
    "level": "mid",
    "question": "What is Glide or Picasso?",
    "short_answer": "Image loading libraries that handle downloading, caching, and displaying images efficiently with memory management.",
    "look_for": "Experience with image loading, understanding of caching strategies."
  },
  {
    "id": 65,
    "level": "mid",
    "question": "What is ProGuard/R8?",
    "short_answer": "Code obfuscation and optimization tools that shrink, optimize, and obfuscate code to reduce APK size and improve security.",
    "look_for": "Understanding of release builds, knowledge of keep rules for reflection-based libraries."
  },
  {
    "id": 66,
    "level": "mid",
    "question": "What is the difference between MVC, MVP, and MVVM?",
    "short_answer": "MVC: Controller handles logic. MVP: Presenter handles logic with interface. MVVM: ViewModel with data binding and lifecycle awareness.",
    "look_for": "Understanding of separation of concerns and testability benefits."
  },
  {
    "id": 67,
    "level": "mid",
    "question": "What is WorkManager?",
    "short_answer": "WorkManager is a library for deferrable, guaranteed background work that respects system constraints and survives app restarts.",
    "look_for": "Understanding of when to use WorkManager vs other background solutions."
  },
  {
    "id": 68,
    "level": "mid",
    "question": "What is the Repository pattern?",
    "short_answer": "Repository mediates between data sources (network, database) and the rest of the app, providing a clean API for data access.",
    "look_for": "Understanding of single source of truth and data layer abstraction."
  },
  {
    "id": 69,
    "level": "mid",
    "question": "What is Dependency Injection?",
    "short_answer": "A design pattern where dependencies are provided to classes rather than created by them, improving testability and modularity.",
    "look_for": "Familiarity with DI frameworks like Dagger, Hilt, or Koin."
  },
  {
    "id": 70,
    "level": "mid",
    "question": "What is the difference between Handler and HandlerThread?",
    "short_answer": "Handler posts messages to a thread's message queue. HandlerThread is a Thread with a Looper for handling messages sequentially.",
    "look_for": "Understanding of message queue and when to use for background operations."
  },
  {
    "id": 71,
    "level": "mid",
    "question": "What is DiffUtil in RecyclerView?",
    "short_answer": "DiffUtil calculates the difference between two lists and outputs a list of update operations that efficiently updates the RecyclerView.",
    "look_for": "Understanding of performance benefits and implementation of areItemsTheSame and areContentsTheSame."
  },
  {
    "id": 72,
    "level": "mid",
    "question": "What is ViewBinding?",
    "short_answer": "ViewBinding generates binding classes for XML layouts, providing type-safe access to views without findViewById and reducing null pointer exceptions.",
    "look_for": "Understanding of benefits over findViewById and difference from DataBinding."
  },
  {
    "id": 73,
    "level": "mid",
    "question": "What is the Navigation Component?",
    "short_answer": "A Jetpack library that handles fragment transactions, back stack management, deep links, and safe argument passing with a visual navigation graph.",
    "look_for": "Experience with navigation graph, SafeArgs, and handling navigation actions."
  },
  {
    "id": 74,
    "level": "mid",
    "question": "What is the difference between HashMap and ArrayMap?",
    "short_answer": "HashMap uses more memory but faster for large datasets. ArrayMap is memory-efficient for small datasets (< 1000 items) but slower for large ones.",
    "look_for": "Understanding of Android-specific collections and memory optimization."
  },
  {
    "id": 75,
    "level": "mid",
    "question": "What is Paging library?",
    "short_answer": "Paging library helps load and display large datasets gradually, loading data in chunks to reduce memory usage and network bandwidth.",
    "look_for": "Experience with PagingSource, PagingData, and integration with RecyclerView."
  },
  {
    "id": 76,
    "level": "mid",
    "question": "What is the difference between lateinit and lazy?",
    "short_answer": "lateinit is for var properties initialized later, throws exception if accessed before initialization. lazy is for val properties with initialization code run on first access.",
    "look_for": "Understanding of Kotlin initialization patterns and when to use each."
  },
  {
    "id": 77,
    "level": "mid",
    "question": "What is DataBinding?",
    "short_answer": "DataBinding binds UI components in layouts directly to data sources using declarative format in XML, reducing boilerplate code.",
    "look_for": "Experience with binding adapters, two-way binding, and understanding of generated code."
  },
  {
    "id": 78,
    "level": "mid",
    "question": "What is JobScheduler?",
    "short_answer": "JobScheduler schedules background jobs that run based on conditions like network availability, charging state, or device idle.",
    "look_for": "Understanding of when to use JobScheduler vs WorkManager (WorkManager is now preferred)."
  },
  {
    "id": 79,
    "level": "mid",
    "question": "What is the difference between launch and async in coroutines?",
    "short_answer": "launch starts a coroutine that doesn't return a result (returns Job). async starts a coroutine that returns a result via Deferred (like a future).",
    "look_for": "Understanding of when to use each and how to await results from async."
  },
  {
    "id": 80,
    "level": "mid",
    "question": "What is SparseArray?",
    "short_answer": "SparseArray is an Android-optimized map for integer keys, more memory-efficient than HashMap<Integer, Object> for small to medium datasets.",
    "look_for": "Understanding of Android-specific collections for memory optimization."
  },
  {
    "id": 81,
    "level": "mid",
    "question": "What is the difference between Coroutine Dispatchers?",
    "short_answer": "Dispatchers.Main for UI updates, Dispatchers.IO for network/disk operations, Dispatchers.Default for CPU-intensive work, Dispatchers.Unconfined for testing.",
    "look_for": "Understanding of appropriate dispatcher usage for different operations."
  },
  {
    "id": 82,
    "level": "mid",
    "question": "What is a sealed class in Kotlin?",
    "short_answer": "Sealed classes represent restricted class hierarchies where all subclasses are known at compile time, useful for representing state.",
    "look_for": "Understanding of when expressions with sealed classes and state management."
  },
  {
    "id": 83,
    "level": "mid",
    "question": "What is the difference between launch and lifecycleScope.launch?",
    "short_answer": "lifecycleScope.launch automatically cancels coroutines when the lifecycle owner is destroyed, preventing memory leaks and crashes.",
    "look_for": "Understanding of lifecycle-aware coroutine scopes and automatic cancellation."
  },
  {
    "id": 84,
    "level": "mid",
    "question": "What is MotionLayout?",
    "short_answer": "MotionLayout is a layout type that helps you manage motion and widget animation in your app, subclass of ConstraintLayout.",
    "look_for": "Experience with complex animations and understanding of KeyFrames and ConstraintSets."
  },
  {
    "id": 85,
    "level": "mid",
    "question": "What is the difference between cold and hot streams in Flow?",
    "short_answer": "Cold streams start emitting when collected and emit to one collector. Hot streams emit regardless of collectors and can have multiple collectors.",
    "look_for": "Understanding of StateFlow (hot) vs regular Flow (cold) use cases."
  },
  {
    "id": 86,
    "level": "mid",
    "question": "What is a companion object in Kotlin?",
    "short_answer": "Companion object is an object tied to a class (not instance) that allows you to define static-like members and factory methods.",
    "look_for": "Understanding of how it differs from Java static and @JvmStatic annotation."
  },
  {
    "id": 87,
    "level": "mid",
    "question": "What is the difference between Mutable and Immutable collections in Kotlin?",
    "short_answer": "Mutable collections (MutableList, MutableSet) can be modified. Immutable collections (List, Set) are read-only interfaces.",
    "look_for": "Understanding that immutable doesn't mean truly immutable, just read-only interface."
  },
  {
    "id": 88,
    "level": "mid",
    "question": "What is the difference between StateFlow and SharedFlow?",
    "short_answer": "StateFlow always has a value and replays the latest value to new collectors. SharedFlow can have zero or multiple replayed values and supports more configuration.",
    "look_for": "Understanding of when to use each, knowledge of replay cache and buffer configuration."
  },
  {
    "id": 89,
    "level": "mid",
    "question": "What is Hilt?",
    "short_answer": "Hilt is a dependency injection library built on top of Dagger, providing a standard way to incorporate DI in Android apps with less boilerplate.",
    "look_for": "Experience with @HiltAndroidApp, @AndroidEntryPoint, and understanding of component hierarchy."
  },
  {
    "id": 90,
    "level": "mid",
    "question": "What is the difference between apply and commit in SharedPreferences?",
    "short_answer": "apply() is asynchronous and doesn't return a result. commit() is synchronous, blocks the thread, and returns a boolean indicating success.",
    "look_for": "Understanding of when to use each based on need for immediate persistence or return value."
  },
  {
    "id": 91,
    "level": "mid",
    "question": "What is data class in Kotlin?",
    "short_answer": "Data class automatically generates equals(), hashCode(), toString(), copy(), and componentN() functions for holding data.",
    "look_for": "Understanding of auto-generated functions and when to use data classes."
  },
  {
    "id": 92,
    "level": "mid",
    "question": "What is the difference between let, run, with, apply, and also in Kotlin?",
    "short_answer": "let (it, returns lambda result), run (this, returns lambda result), with (this, returns lambda result), apply (this, returns context object), also (it, returns context object).",
    "look_for": "Understanding of context object reference, return value, and appropriate use cases."
  },
  {
    "id": 93,
    "level": "mid",
    "question": "What is a Content URI?",
    "short_answer": "Content URI is a URI that identifies data in a ContentProvider, following the pattern content://authority/path/id.",
    "look_for": "Understanding of URI structure and how to query data using ContentResolver."
  },
  {
    "id": 94,
    "level": "mid",
    "question": "What is the difference between Looper and Handler?",
    "short_answer": "Looper runs a message loop in a thread. Handler posts messages to and processes messages from a Looper's message queue.",
    "look_for": "Understanding of message queue threading model."
  },
  {
    "id": 95,
    "level": "mid",
    "question": "What is OkHttp?",
    "short_answer": "OkHttp is an HTTP client for Android that efficiently handles connections, supports HTTP/2, connection pooling, and transparent GZIP compression.",
    "look_for": "Experience with interceptors, connection pooling, and understanding it's used by Retrofit."
  },
  {
    "id": 96,
    "level": "mid",
    "question": "What is extension function in Kotlin?",
    "short_answer": "Extension functions allow you to add new functions to existing classes without modifying their source code.",
    "look_for": "Understanding of how they're resolved statically and practical use cases."
  },
  {
    "id": 97,
    "level": "mid",
    "question": "What is the difference between onSaveInstanceState and ViewModel?",
    "short_answer": "onSaveInstanceState saves small amounts of data during process death. ViewModel survives configuration changes but not process death.",
    "look_for": "Understanding of when to use each and SavedStateHandle in ViewModel."
  },
  {
    "id": 98,
    "level": "mid",
    "question": "What is @Parcelize annotation in Kotlin?",
    "short_answer": "@Parcelize auto-generates Parcelable implementation for data classes, eliminating boilerplate code.",
    "look_for": "Understanding that it requires kotlin-parcelize plugin and works with data classes."
  },
  {
    "id": 99,
    "level": "mid",
    "question": "What is the difference between FragmentPagerAdapter and FragmentStatePagerAdapter?",
    "short_answer": "FragmentPagerAdapter keeps fragments in memory. FragmentStatePagerAdapter destroys fragments and saves state, better for many pages.",
    "look_for": "Understanding that both are deprecated in favor of ViewPager2 with FragmentStateAdapter."
  },
  {
    "id": 100,
    "level": "mid",
    "question": "What is Espresso?",
    "short_answer": "Espresso is a UI testing framework for Android that provides APIs to write concise, reliable UI tests.",
    "look_for": "Experience writing UI tests, understanding of ViewMatchers and ViewActions."
  },
  {
    "id": 101,
    "level": "senior",
    "question": "Explain Android's multi-module architecture and its benefits.",
    "short_answer": "Multi-module architecture divides app into feature modules, improving build times, reusability, and enforcing separation of concerns. Supports dynamic feature modules.",
    "look_for": "Experience designing module dependencies, understanding of Gradle configuration, knowledge of dynamic delivery."
  },
  {
    "id": 102,
    "level": "senior",
    "question": "What is Jetpack Compose and how does it differ from XML layouts?",
    "short_answer": "Compose is a declarative UI toolkit using Kotlin functions instead of XML. It simplifies UI development with reactive paradigm and eliminates need for findViewById.",
    "look_for": "Experience with Compose, understanding of recomposition, state management, and side effects."
  },
  {
    "id": 103,
    "level": "senior",
    "question": "Explain the Clean Architecture principles in Android.",
    "short_answer": "Clean Architecture separates code into layers (Presentation, Domain, Data) with dependency inversion, making code testable, maintainable, and independent of frameworks.",
    "look_for": "Understanding of use cases, entities, repository pattern, and dependency rule (inner layers don't know outer layers)."
  },
  {
    "id": 104,
    "level": "senior",
    "question": "What are coroutines channels and their use cases?",
    "short_answer": "Channels are hot streams for communicating between coroutines, similar to blocking queues but suspending. Support different buffer strategies and closing.",
    "look_for": "Understanding of channel types (rendezvous, buffered, conflated, unlimited), when to use over Flow."
  },
  {
    "id": 105,
    "level": "senior",
    "question": "Explain the concept of structured concurrency in coroutines.",
    "short_answer": "Structured concurrency ensures coroutines are organized in a hierarchy where parent waits for children, and cancellation propagates down, preventing leaks.",
    "look_for": "Understanding of CoroutineScope, Job hierarchy, exception handling, and supervision strategies."
  },
  {
    "id": 106,
    "level": "senior",
    "question": "What is the difference between Flow and RxJava?",
    "short_answer": "Flow is Kotlin-native, cold by default, and integrated with coroutines. RxJava is Java-based, has more operators, and uses backpressure strategies.",
    "look_for": "Understanding of when to use each, migration strategies, and performance considerations."
  },
  {
    "id": 107,
    "level": "senior",
    "question": "How do you handle process death and state restoration?",
    "short_answer": "Combine ViewModel with SavedStateHandle for UI state, onSaveInstanceState for critical data, and Room/DataStore for persistent data.",
    "look_for": "Understanding of state restoration priority, testing with 'Don't keep activities', knowledge of SavedStateHandle."
  },
  {
    "id": 108,
    "level": "senior",
    "question": "Explain Android's security best practices.",
    "short_answer": "Use HTTPS, implement certificate pinning, encrypt sensitive data, use Android Keystore, apply ProGuard/R8, validate inputs, use SafetyNet, implement proper permissions.",
    "look_for": "Understanding of encryption APIs, secure storage, network security config, and common vulnerabilities."
  },
  {
    "id": 109,
    "level": "senior",
    "question": "What is the difference between deep links, app links, and dynamic links?",
    "short_answer": "Deep links open app via URL. App links are verified HTTP URLs that open app directly. Dynamic links are Firebase feature supporting cross-platform with analytics.",
    "look_for": "Understanding of Digital Asset Links verification, intent filters, and handling navigation from links."
  },
  {
    "id": 110,
    "level": "senior",
    "question": "Explain memory leaks in Android and how to prevent them.",
    "short_answer": "Memory leaks occur when objects are held in memory after they're no longer needed. Common causes: static references, non-static inner classes, listeners, handlers.",
    "look_for": "Experience with LeakCanary, understanding of weak references, proper lifecycle management, and memory profiling."
  },
  {
    "id": 111,
    "level": "senior",
    "question": "What is Gradle build optimization?",
    "short_answer": "Enable build cache, use implementation vs api, enable parallel execution, use incremental builds, optimize dependency resolution, consider modularization.",
    "look_for": "Understanding of build scan analysis, configuration cache, and impact of different dependency configurations."
  },
  {
    "id": 112,
    "level": "senior",
    "question": "Explain Android's threading models and best practices.",
    "short_answer": "Main thread for UI, worker threads for operations. Use coroutines with appropriate dispatchers, avoid blocking operations, implement proper cancellation.",
    "look_for": "Deep understanding of thread safety, race conditions, deadlocks, and modern concurrency patterns."
  },
  {
    "id": 113,
    "level": "senior",
    "question": "What is App Startup library?",
    "short_answer": "App Startup provides a performant way to initialize components at app launch, allowing sequential and parallel initialization with shared single ContentProvider.",
    "look_for": "Understanding of initialization order, dependencies between initializers, and performance benefits over multiple ContentProviders."
  },
  {
    "id": 114,
    "level": "senior",
    "question": "Explain Android's rendering pipeline.",
    "short_answer": "Measure → Layout → Draw phases. UI thread prepares display lists, RenderThread rasterizes, and GPU composites layers. Target 16ms per frame for 60fps.",
    "look_for": "Understanding of Choreographer, VSYNC, GPU overdraw, and optimization techniques like reducing view hierarchy depth."
  },
  {
    "id": 115,
    "level": "senior",
    "question": "What is the difference between MutableStateFlow and MutableSharedFlow?",
    "short_answer": "MutableStateFlow requires initial value, conflates updates, replays latest value. MutableSharedFlow doesn't require initial value, configurable replay, supports multiple emissions.",
    "look_for": "Understanding of conflation behavior, appropriate use cases, and performance implications."
  },
  {
    "id": 116,
    "level": "senior",
    "question": "How do you implement offline-first architecture?",
    "short_answer": "Use Room as single source of truth, sync with network, implement conflict resolution, queue operations when offline, use WorkManager for sync.",
    "look_for": "Experience with Repository pattern, understanding of data synchronization strategies, conflict resolution approaches."
  },
  {
    "id": 117,
    "level": "senior",
    "question": "Explain Android's permission system changes across versions.",
    "short_answer": "Runtime permissions (API 23), background location (API 29), scoped storage (API 29-30), permission dialogs changes (API 30), approximate location (API 31).",
    "look_for": "Deep understanding of permission handling across versions, best practices for requesting permissions, alternative approaches."
  },
  {
    "id": 118,
    "level": "senior",
    "question": "What is the Composition Local in Jetpack Compose?",
    "short_answer": "CompositionLocal provides implicit way to pass data down the composition tree without explicitly passing through every composable.",
    "look_for": "Understanding of when to use, difference between staticCompositionLocalOf and compositionLocalOf, and alternatives."
  },
  {
    "id": 119,
    "level": "senior",
    "question": "Explain Android's testing pyramid.",
    "short_answer": "70% unit tests (fast, isolated), 20% integration tests (module interactions), 10% UI tests (end-to-end). Balance speed, reliability, and coverage.",
    "look_for": "Experience with JUnit, Mockito/MockK, Espresso, understanding of test doubles, and CI/CD integration."
  },
  {
    "id": 120,
    "level": "senior",
    "question": "What is ViewPager2 and its advantages over ViewPager?",
    "short_answer": "ViewPager2 uses RecyclerView internally, supports vertical scrolling, RTL layout, and notifyDataSetChanged properly. More flexible and performant.",
    "look_for": "Understanding of migration from ViewPager, DiffUtil usage, and handling of nested scrolling."
  },
  {
    "id": 121,
    "level": "senior",
    "question": "Explain the concept of single source of truth.",
    "short_answer": "One authoritative data source (usually local database) that other parts of the app read from, ensuring consistency and simplifying data flow.",
    "look_for": "Understanding of Repository pattern, cache invalidation strategies, and conflict resolution."
  },
  {
    "id": 122,
    "level": "senior",
    "question": "What is Kotlin Multiplatform Mobile (KMM)?",
    "short_answer": "KMM allows sharing code between Android and iOS, particularly business logic, while keeping platform-specific UI code separate.",
    "look_for": "Understanding of expect/actual mechanism, experience with shared module setup, awareness of limitations."
  },
  {
    "id": 123,
    "level": "senior",
    "question": "How do you optimize RecyclerView performance?",
    "short_answer": "Use DiffUtil, set fixed size, implement ViewHolder properly, avoid expensive operations in onBind, use RecycledViewPool for nested RecyclerViews, implement pagination.",
    "look_for": "Deep understanding of RecyclerView internals, measurement, layout, and scrolling performance optimization."
  },
  {
    "id": 124,
    "level": "senior",
    "question": "Explain Android's scoped storage.",
    "short_answer": "Scoped storage restricts app access to external storage, requiring MediaStore API for media files and Storage Access Framework for documents.",
    "look_for": "Understanding of migration strategies, handling legacy storage, knowledge of MANAGE_EXTERNAL_STORAGE permission implications."
  },
  {
    "id": 125,
    "level": "senior",
    "question": "What is the difference between Dispatchers.IO and Dispatchers.Default?",
    "short_answer": "Dispatchers.IO has shared thread pool (64 threads) optimized for blocking operations. Dispatchers.Default has limited threads (CPU cores) for CPU-intensive work.",
    "look_for": "Understanding of thread pool sizing, when to use each, and custom dispatcher creation."
  },
  {
    "id": 126,
    "level": "senior",
    "question": "How do you implement a custom View?",
    "short_answer": "Extend View or ViewGroup, override onMeasure, onLayout (ViewGroup), onDraw, handle touch events, manage state, and provide custom attributes.",
    "look_for": "Understanding of measurement specs, canvas drawing, touch event handling, and performance considerations."
  },
  {
    "id": 127,
    "level": "senior",
    "question": "Explain Android's window and surface management.",
    "short_answer": "Window contains View hierarchy, Surface is drawing buffer. SurfaceView for separate rendering thread, TextureView for transformation, SurfaceFlinger composites surfaces.",
    "look_for": "Understanding of surface lifecycle, double buffering, hardware acceleration, and when to use SurfaceView vs TextureView."
  },
  {
    "id": 128,
    "level": "senior",
    "question": "What is flow operators and their categories?",
    "short_answer": "Terminal operators (collect, toList), intermediate operators (map, filter, transform), and flow builders (flow, channelFlow). Transform flow emissions without collecting.",
    "look_for": "Understanding of cold flow nature, operator chaining, context preservation, and performance considerations."
  },
  {
    "id": 129,
    "level": "senior",
    "question": "How do you handle configuration changes efficiently?",
    "short_answer": "Use ViewModel for UI state, handle orientation in manifest if needed, use fragments carefully, implement proper state saving, consider ViewModel with SavedStateHandle.",
    "look_for": "Deep understanding of configuration change impact, when to handle vs prevent, and testing strategies."
  },
  {
    "id": 130,
    "level": "senior",
    "question": "Explain Android's backup and restore mechanisms.",
    "short_answer": "Auto Backup (API 23+) for files, Key/Value Backup for small data. BackupAgent for custom backup logic. Configure in manifest and test thoroughly.",
    "look_for": "Understanding of backup rules XML, include/exclude patterns, and restore testing."
  },
  {
    "id": 131,
    "level": "senior",
    "question": "What is the difference between suspendCoroutine and suspendCancellableCoroutine?",
    "short_answer": "suspendCancellableCoroutine supports cancellation handling, allowing cleanup when coroutine is cancelled. Use for wrapping callback-based APIs.",
    "look_for": "Understanding of cancellation handling, proper resource cleanup, and integration with non-coroutine APIs."
  },
  {
    "id": 132,
    "level": "senior",
    "question": "How do you implement real-time data synchronization?",
    "short_answer": "Use WebSocket or Firebase Realtime Database, implement conflict resolution (last-write-wins, operational transformation), handle connection state, queue offline changes.",
    "look_for": "Experience with real-time protocols, understanding of consistency models, and conflict resolution strategies."
  },
  {
    "id": 133,
    "level": "senior",
    "question": "Explain Android's process lifecycle and priority.",
    "short_answer": "Foreground (visible activity), Visible (visible but not foreground), Service (started service), Background (stopped activity), Empty (no components). System kills lowest priority first.",
    "look_for": "Understanding of process management, how to increase priority, and handling process death."
  },
  {
    "id": 134,
    "level": "senior",
    "question": "What is Kotlin's inline functions and when to use them?",
    "short_answer": "Inline functions replace function call with function body at compile time, avoiding object allocation for lambdas. Use for higher-order functions.",
    "look_for": "Understanding of performance benefits, code size trade-offs, reified type parameters, and non-local returns."
  },
  {
    "id": 135,
    "level": "senior",
    "question": "How do you implement proper error handling in coroutines?",
    "short_answer": "Use try-catch in coroutine body, CoroutineExceptionHandler for uncaught exceptions, SupervisorJob to prevent exception propagation to siblings.",
    "look_for": "Understanding of exception propagation, structured concurrency implications, and error handling patterns."
  },
  {
    "id": 136,
    "level": "senior",
    "question": "Explain Android's animation framework.",
    "short_answer": "Property Animation (ObjectAnimator, ValueAnimator), View Animation (deprecated), Transition API for scene changes, MotionLayout for complex animations.",
    "look_for": "Understanding of different animation types, interpolators, AnimatorSet, and performance optimization."
  },
  {
    "id": 137,
    "level": "senior",
    "question": "What is the difference between Room's @Dao suspend functions and Flow?",
    "short_answer": "Suspend functions execute once and return result. Flow observes database changes and emits new data automatically when table updates.",
    "look_for": "Understanding of reactive database queries, when to use each approach, and performance implications."
  },
  {
    "id": 138,
    "level": "senior",
    "question": "How do you implement app modularization strategy?",
    "short_answer": "Separate features into modules, define clear dependencies (feature modules depend on core/data), use dependency injection, implement navigation boundaries.",
    "look_for": "Experience with module structure design, understanding of build performance impact, and dependency management."
  },
  {
    "id": 139,
    "level": "senior",
    "question": "Explain Android's WorkManager constraints and execution.",
    "short_answer": "WorkManager supports constraints (network, battery, storage), guarantees execution, survives process death, handles backoff policies, supports chaining.",
    "look_for": "Deep understanding of work types (OneTime, Periodic), execution guarantees, and migration from JobScheduler."
  },
  {
    "id": 140,
    "level": "senior",
    "question": "What is SharedFlow's replay cache and buffer?",
    "short_answer": "Replay cache stores emissions for new subscribers. Buffer stores emissions when no subscribers or slow subscribers, configurable with overflow strategies.",
    "look_for": "Understanding of buffer strategies (suspend, drop oldest/latest), replay behavior, and memory implications."
  },
  {
    "id": 141,
    "level": "senior",
    "question": "How do you implement deep linking navigation with Navigation Component?",
    "short_answer": "Define nav_graph with deepLink tags, add intent-filter in manifest, handle arguments with SafeArgs, implement PendingIntent for notifications.",
    "look_for": "Experience with nested graphs, argument passing, and handling edge cases like authenticated screens."
  },
  {
    "id": 142,
    "level": "senior",
    "question": "Explain Compose's side effects (LaunchedEffect, DisposableEffect, etc.).",
    "short_answer": "LaunchedEffect for suspend functions, DisposableEffect for cleanup, SideEffect for non-compose state, derivedStateOf for computed state, snapshotFlow for Flow conversion.",
    "look_for": "Understanding of when to use each, avoiding infinite recomposition, and proper key management."
  },
  {
    "id": 143,
    "level": "senior",
    "question": "What is Android's memory management and garbage collection?",
    "short_answer": "ART uses generational garbage collection (young, old generations), compacting GC to reduce fragmentation. Apps have limited heap size based on device.",
    "look_for": "Understanding of GC impact on performance, memory profiling, and leak detection techniques."
  },
  {
    "id": 144,
    "level": "senior",
    "question": "How do you implement effective caching strategy?",
    "short_answer": "Multi-layer caching: memory (LruCache), disk (Room, DataStore), network. Implement cache invalidation, expiration policies, and cache-aside pattern.",
    "look_for": "Understanding of cache coherency, invalidation strategies, and appropriate cache sizes."
  },
  {
    "id": 145,
    "level": "senior",
    "question": "Explain Android's Input Method Framework.",
    "short_answer": "IMF manages soft keyboard interaction, handles input connection, provides InputMethodManager API. Custom views implement InputConnection for complex input.",
    "look_for": "Understanding of keyboard visibility handling, IME actions, and custom input handling."
  },
  {
    "id": 146,
    "level": "senior",
    "question": "What is Kotlin's delegation pattern and property delegates?",
    "short_answer": "Class delegation (by keyword) delegates interface implementation. Property delegates (by keyword) delegate property accessors to another object.",
    "look_for": "Understanding of lazy, observable delegates, and creating custom delegates."
  },
  {
    "id": 147,
    "level": "senior",
    "question": "How do you optimize app startup time?",
    "short_answer": "Lazy initialization, avoid work in Application.onCreate, use App Startup library, optimize dependencies, implement splash screen properly, profile with Perfetto.",
    "look_for": "Experience with startup profiling, understanding of critical path, and measurement techniques."
  },
  {
    "id": 148,
    "level": "senior",
    "question": "Explain Android's notification channels and importance.",
    "short_answer": "Channels (API 26+) let users control notification behavior per category. Importance determines interruption level: urgent, high, default, low, min.",
    "look_for": "Understanding of channel management, notification best practices, and user control considerations."
  },
  {
    "id": 149,
    "level": "senior",
    "question": "What is Kotlin's coroutine context and its elements?",
    "short_answer": "CoroutineContext is a set of elements: Job (lifecycle), Dispatcher (thread), CoroutineName (debugging), CoroutineExceptionHandler (errors).",
    "look_for": "Understanding of context inheritance, combination with plus operator, and withContext usage."
  },
  {
    "id": 150,
    "level": "senior",
    "question": "How do you implement proper logging strategy?",
    "short_answer": "Use Timber for structured logging, remove logs in release builds with ProGuard, implement crash reporting (Firebase Crashlytics), log appropriate levels.",
    "look_for": "Understanding of logging best practices, security implications, and integration with monitoring tools."
  },
  {
    "id": 151,
    "level": "senior",
    "question": "Explain Android's JobIntentService and when to use it.",
    "short_answer": "JobIntentService is a bridge between IntentService and JobScheduler, handling work on background thread. Now deprecated in favor of WorkManager.",
    "look_for": "Understanding of migration path to WorkManager and backwards compatibility considerations."
  },
  {
    "id": 152,
    "level": "senior",
    "question": "What is Compose's remember and rememberSaveable?",
    "short_answer": "remember stores value across recompositions. rememberSaveable survives configuration changes and process death by saving to Bundle.",
    "look_for": "Understanding of state preservation, custom Saver implementation, and memory implications."
  },
  {
    "id": 153,
    "level": "senior",
    "question": "How do you implement efficient bitmap loading and caching?",
    "short_answer": "Calculate inSampleSize, decode bounds first, use RGB_565 when possible, implement LruCache, handle OutOfMemory gracefully, use libraries like Glide/Coil.",
    "look_for": "Understanding of bitmap memory usage, sampling, and hardware vs software bitmaps."
  },
  {
    "id": 154,
    "level": "senior",
    "question": "Explain Android's App Bundle and Dynamic Feature Modules.",
    "short_answer": "App Bundle optimizes APK delivery per device config. Dynamic Features are downloaded on-demand, reducing initial install size, supporting conditional/on-demand delivery.",
    "look_for": "Experience with bundle generation, understanding of split APKs, and implementing dynamic feature navigation."
  },
  {
    "id": 155,
    "level": "senior",
    "question": "What is Kotlin's reified type parameters?",
    "short_answer": "Reified allows accessing type information at runtime in inline functions, enabling operations like is checks and getting class references.",
    "look_for": "Understanding of inline function requirement, use cases like generic type checking, and limitations."
  },
  {
    "id": 156,
    "level": "senior",
    "question": "How do you implement proper database migrations in Room?",
    "short_answer": "Define Migration objects specifying version range and SQL statements, add to database builder, test migrations, handle complex schema changes.",
    "look_for": "Experience with migration testing, understanding of destructive vs non-destructive migrations, and fallback strategies."
  },
  {
    "id": 157,
    "level": "senior",
    "question": "Explain Android's StrictMode and its usage.",
    "short_answer": "StrictMode detects disk reads/writes, network operations on main thread, and other violations. Use in debug builds to catch performance issues early.",
    "look_for": "Understanding of policies (thread, VM), penalty configuration, and integration in development workflow."
  },
  {
    "id": 158,
    "level": "senior",
    "question": "What is the difference between produceIn and channelFlow?",
    "short_answer": "produceIn creates a channel from a coroutine scope. channelFlow creates a cold Flow that uses a channel internally, better for Flow operators.",
    "look_for": "Understanding of when to use channels vs Flow, and callback-to-Flow conversion patterns."
  },
  {
    "id": 159,
    "level": "senior",
    "question": "How do you implement A/B testing in Android?",
    "short_answer": "Use Firebase Remote Config or similar service, implement feature flags, track analytics, ensure proper randomization and consistent user experience.",
    "look_for": "Experience with experimentation platforms, understanding of statistical significance, and implementation patterns."
  },
  {
    "id": 160,
    "level": "senior",
    "question": "Explain Android's Accessibility framework.",
    "short_answer": "Provide contentDescription, use semantic markup, support TalkBack, ensure touch target sizes (48dp), maintain proper focus order, test with accessibility services.",
    "look_for": "Understanding of AccessibilityNodeInfo, custom View accessibility, and WCAG guidelines."
  },
  {
    "id": 161,
    "level": "senior",
    "question": "What is Kotlin's contravariance and covariance?",
    "short_answer": "Covariance (out) allows reading but not writing (producer). Contravariance (in) allows writing but not reading (consumer). PECS principle.",
    "look_for": "Deep understanding of variance, use-site vs declaration-site variance, and practical applications."
  },
  {
    "id": 162,
    "level": "senior",
    "question": "How do you implement proper WebView security?",
    "short_answer": "Validate URLs, disable JavaScript if not needed, implement shouldOverrideUrlLoading, avoid addJavascriptInterface, use HTTPS, keep WebView updated.",
    "look_for": "Understanding of XSS attacks, JavaScript bridge security, and WebView configuration best practices."
  },
  {
    "id": 163,
    "level": "senior",
    "question": "Explain Android's Content Provider security.",
    "short_answer": "Use permissions (readPermission, writePermission), implement path permissions, validate URIs, sanitize inputs, avoid SQL injection.",
    "look_for": "Understanding of security implications, proper permission configuration, and query validation."
  },
  {
    "id": 164,
    "level": "senior",
    "question": "What is DataStore and how does it differ from SharedPreferences?",
    "short_answer": "DataStore is type-safe (Proto DataStore) or uses Flow, handles exceptions properly, supports migrations, and provides consistency guarantees. Built on coroutines.",
    "look_for": "Understanding of Preferences DataStore vs Proto DataStore, migration from SharedPreferences, and error handling."
  },
  {
    "id": 165,
    "level": "senior",
    "question": "How do you implement proper network layer architecture?",
    "short_answer": "Separate API service, data models, and mappers. Implement retry logic, timeout configuration, error handling, certificate pinning, request/response interceptors.",
    "look_for": "Experience with Retrofit configuration, OkHttp customization, and error handling patterns."
  },
  {
    "id": 166,
    "level": "senior",
    "question": "Explain Android's Canvas and custom drawing.",
    "short_answer": "Canvas provides drawing API (drawRect, drawPath, etc.). Paint defines style. Path defines shapes. Use for custom views, charts, complex graphics.",
    "look_for": "Understanding of coordinate systems, Paint styles, hardware acceleration limitations, and performance optimization."
  },
  {
    "id": 167,
    "level": "senior",
    "question": "What is Kotlin's inline classes (value classes)?",
    "short_answer": "Value classes wrap a single value without allocation overhead at runtime, providing type safety without performance cost.",
    "look_for": "Understanding of use cases, boxing scenarios, and restrictions on value classes."
  },
  {
    "id": 168,
    "level": "senior",
    "question": "How do you implement proper error handling in Repository pattern?",
    "short_answer": "Use sealed classes for Result/State, wrap network/database exceptions, provide meaningful error messages, implement retry logic, log errors appropriately.",
    "look_for": "Understanding of error propagation, user-facing error messages, and recovery strategies."
  },
  {
    "id": 169,
    "level": "senior",
    "question": "Explain Android's PendingIntent flags and their importance.",
    "short_answer": "FLAG_IMMUTABLE (recommended, Android 12+), FLAG_MUTABLE (explicit mutability), FLAG_UPDATE_CURRENT, FLAG_ONE_SHOT, FLAG_CANCEL_CURRENT affect intent behavior and security.",
    "look_for": "Understanding of security implications, Android 12 requirements, and appropriate flag usage."
  },
  {
    "id": 170,
    "level": "senior",
    "question": "What is Compose's derivedStateOf and when to use it?",
    "short_answer": "derivedStateOf creates computed state that only recomposes when result changes, not when inputs change, optimizing expensive calculations.",
    "look_for": "Understanding of recomposition optimization, comparison with remember, and appropriate use cases."
  },
  {
    "id": 171,
    "level": "senior",
    "question": "How do you implement proper analytics architecture?",
    "short_answer": "Abstract analytics behind interface, support multiple providers, track events consistently, implement privacy controls, test analytics in debug builds.",
    "look_for": "Understanding of analytics best practices, event taxonomy, and GDPR compliance considerations."
  },
  {
    "id": 172,
    "level": "senior",
    "question": "Explain Android's MediaPlayer vs ExoPlayer.",
    "short_answer": "MediaPlayer is basic, built-in player. ExoPlayer is flexible, supports more formats, adaptive streaming, DRM, extensible, and regularly updated.",
    "look_for": "Understanding of use cases, format support, and migration to Media3."
  },
  {
    "id": 173,
    "level": "senior",
    "question": "What is Kotlin's Nothing type?",
    "short_answer": "Nothing is a type with no instances, representing functions that never return normally (always throw or infinite loop). Subtype of all types.",
    "look_for": "Understanding of type system implications, use in throw expressions, and nullable Nothing?."
  },
  {
    "id": 174,
    "level": "senior",
    "question": "How do you implement proper pagination with Paging 3?",
    "short_answer": "Implement PagingSource, define RemoteMediator for network+database, configure PagingConfig, collect PagingData in ViewModel, submit to PagingDataAdapter.",
    "look_for": "Understanding of RemoteMediator for offline support, error handling, and retry mechanisms."
  },
  {
    "id": 175,
    "level": "senior",
    "question": "Explain Android's Foreground Services and notification requirements.",
    "short_answer": "Foreground services require persistent notification (Android 8+), must call startForeground within 5 seconds, need FOREGROUND_SERVICE permission, subject to restrictions.",
    "look_for": "Understanding of foreground service types (Android 11+), restrictions, and proper lifecycle management."
  },
  {
    "id": 176,
    "level": "senior",
    "question": "What is the difference between callbackFlow and channelFlow?",
    "short_answer": "Both create Flow from callback APIs. callbackFlow has explicit send channel control. channelFlow is simpler for most cases. Both are hot while collecting.",
    "look_for": "Understanding of awaitClose importance, ProducerScope vs SendChannel, and cancellation handling."
  },
  {
    "id": 177,
    "level": "senior",
    "question": "How do you implement proper localization and internationalization?",
    "short_answer": "Use string resources with qualifiers, support RTL layouts, format dates/numbers properly, handle plurals, test with pseudolocales, consider cultural differences.",
    "look_for": "Understanding of resource qualifiers, RTL support, and common localization pitfalls."
  },
  {
    "id": 178,
    "level": "senior",
    "question": "Explain Android's Network Security Configuration.",
    "short_answer": "XML file defining app's network security settings: trusted CAs, certificate pinning, cleartext traffic policy, debug overrides.",
    "look_for": "Understanding of certificate pinning implementation, cleartext traffic implications, and security best practices."
  },
  {
    "id": 179,
    "level": "senior",
    "question": "What is Compose's produceState?",
    "short_answer": "produceState launches a coroutine to produce a State value from suspend functions, bridging non-Compose state sources into Compose.",
    "look_for": "Understanding of state production patterns, lifecycle awareness, and comparison with LaunchedEffect + mutableStateOf."
  },
  {
    "id": 180,
    "level": "senior",
    "question": "How do you implement proper feature flagging?",
    "short_answer": "Use Remote Config or feature flag service, implement local overrides for testing, separate flag evaluation logic, support gradual rollouts and A/B testing.",
    "look_for": "Understanding of flag lifecycle, testing strategies, and integration with build variants."
  },
  {
    "id": 181,
    "level": "senior",
    "question": "Explain Android's Doze mode and App Standby.",
    "short_answer": "Doze restricts network, wakelocks, and background work when device is idle. App Standby buckets affect job and alarm execution. Use high-priority FCM for urgent messages.",
    "look_for": "Understanding of maintenance windows, exemption strategies, and testing with adb commands."
  },
  {
    "id": 182,
    "level": "senior",
    "question": "What is Kotlin's @JvmOverloads annotation?",
    "short_answer": "@JvmOverloads generates Java overloaded methods for default parameters, enabling Java interop with Kotlin default arguments.",
    "look_for": "Understanding of Java interoperability, use cases, and constructor overloading."
  },
  {
    "id": 183,
    "level": "senior",
    "question": "How do you implement proper dependency management with version catalogs?",
    "short_answer": "Define dependencies in libs.versions.toml, use type-safe accessors, centralize version management, support version ranges and rich versions.",
    "look_for": "Understanding of TOML structure, migration from buildSrc, and convention plugins."
  },
  {
    "id": 184,
    "level": "senior",
    "question": "Explain Android's Background Execution Limits.",
    "short_answer": "Android limits background services (O+), location updates (O+), broadcast receivers (O+). Use WorkManager, JobScheduler, or foreground services appropriately.",
    "look_for": "Understanding of restrictions across Android versions, appropriate alternatives, and migration strategies."
  },
  {
    "id": 185,
    "level": "senior",
    "question": "What is Compose's snapshotFlow?",
    "short_answer": "snapshotFlow converts Compose State reads into a Flow, emitting when any read State changes.",
    "look_for": "Understanding of Snapshot system, use cases for bridging Compose state to Flow consumers."
  },
  {
    "id": 186,
    "level": "senior",
    "question": "How do you implement proper crash reporting and monitoring?",
    "short_answer": "Integrate Firebase Crashlytics or Sentry, log custom events, add breadcrumbs, implement custom exception handler, monitor ANRs, analyze trends.",
    "look_for": "Understanding of symbolication, ProGuard mapping files, and crash analysis techniques."
  },
  {
    "id": 187,
    "level": "senior",
    "question": "Explain Android's Slices.",
    "short_answer": "Slices are UI templates that display app content in other apps (Google Search, Assistant). Define templates for interactive content outside your app.",
    "look_for": "Understanding of Slice providers, templates, and use cases for surfacing app content."
  },
  {
    "id": 188,
    "level": "senior",
    "question": "What is the difference between @Inject constructor and @Provides?",
    "short_answer": "@Inject constructor for types you own. @Provides in modules for third-party classes, interfaces, or complex construction logic.",
    "look_for": "Understanding of Hilt/Dagger dependency provision strategies and when to use each."
  },
  {
    "id": 189,
    "level": "senior",
    "question": "How do you implement proper image pipeline optimization?",
    "short_answer": "Use appropriate formats (WebP, AVIF), implement progressive loading, lazy load images, use placeholder strategies, implement disk/memory caching, resize on server.",
    "look_for": "Understanding of image formats, caching strategies, and performance monitoring."
  },
  {
    "id": 190,
    "level": "senior",
    "question": "Explain Android's ProfileInstaller and baseline profiles.",
    "short_answer": "Baseline profiles define critical code paths for AOT compilation, improving startup time. ProfileInstaller ships profiles with app or installs them post-launch.",
    "look_for": "Understanding of profile generation, ART compilation tiers, and performance impact measurement."
  },
  {
    "id": 191,
    "level": "senior",
    "question": "What is Kotlin's @Parcelize custom serializer?",
    "short_answer": "Implement Parceler<T> interface to customize how specific properties are written to/read from Parcel, handling complex types.",
    "look_for": "Understanding of custom serialization needs and TypeParceler annotation."
  },
  {
    "id": 192,
    "level": "senior",
    "question": "How do you implement proper date/time handling?",
    "short_answer": "Use java.time (API 26+) with desugaring, store timestamps in UTC, format using appropriate locales, handle timezone conversions carefully.",
    "look_for": "Understanding of timezone pitfalls, LocalDateTime vs Instant, and backwards compatibility."
  },
  {
    "id": 193,
    "level": "senior",
    "question": "Explain Android's Package Visibility changes (Android 11+).",
    "short_answer": "Apps can't see all installed packages by default. Declare queries in manifest or use QUERY_ALL_PACKAGES permission for specific use cases.",
    "look_for": "Understanding of privacy implications, query tag usage, and migration strategies."
  },
  {
    "id": 194,
    "level": "senior",
    "question": "What is Compose's CompositionLocalProvider usage?",
    "short_answer": "CompositionLocalProvider sets values for CompositionLocals within a specific composition scope, providing implicit dependencies to child composables.",
    "look_for": "Understanding of scope, appropriate use cases, and alternatives like passing parameters explicitly."
  },
  {
    "id": 195,
    "level": "senior",
    "question": "How do you implement proper build variant configuration?",
    "short_answer": "Use productFlavors for different versions, buildTypes for debug/release, configure signing, ProGuard rules, dependencies per variant, implement flavor-specific code.",
    "look_for": "Understanding of flavor dimensions, variant-specific resources, and build configuration strategies."
  },
  {
    "id": 196,
    "level": "senior",
    "question": "Explain Android's Bubbles API.",
    "short_answer": "Bubbles display conversations and tasks in floating windows. Require notification channel, proper metadata, and conversation shortcuts.",
    "look_for": "Understanding of implementation requirements, use cases for conversational interfaces."
  },
  {
    "id": 197,
    "level": "senior",
    "question": "What is the difference between distinctUntilChanged and distinctUntilChangedBy in Flow?",
    "short_answer": "distinctUntilChanged compares entire emission using equals. distinctUntilChangedBy compares using a selector function result.",
    "look_for": "Understanding of use cases, performance implications, and custom comparators."
  },
  {
    "id": 198,
    "level": "senior",
    "question": "How do you implement proper SQLite performance optimization?",
    "short_answer": "Use indexes, transactions for batch operations, compiled statements, appropriate data types, PRAGMA optimization, avoid N+1 queries.",
    "look_for": "Understanding of query optimization, index strategy, and Room performance best practices."
  },
  {
    "id": 199,
    "level": "senior",
    "question": "Explain Android's ActivityResultContracts API.",
    "short_answer": "ActivityResultContracts replace startActivityForResult, providing type-safe results, cleaner API, support for multiple requests, and testing benefits.",
    "look_for": "Understanding of built-in contracts, custom contracts, and registerForActivityResult usage."
  },
  {
    "id": 200,
    "level": "senior",
    "question": "What is Kotlin's contracts API?",
    "short_answer": "Contracts API allows functions to declare constraints to the compiler (like implies, returns), improving smart-casts and null-safety analysis.",
    "look_for": "Understanding of contract declarations, use cases, and limitations."
  },
  {
    "id": 201,
    "level": "senior",
    "question": "How do you implement proper memory leak detection?",
    "short_answer": "Use LeakCanary, implement weak references where appropriate, avoid static references to Context, properly unregister listeners, test configuration changes.",
    "look_for": "Understanding of common leak patterns, profiling techniques, and prevention strategies."
  },
  {
    "id": 202,
    "level": "senior",
    "question": "Explain Android's App Shortcuts.",
    "short_answer": "Static shortcuts in XML, dynamic shortcuts via ShortcutManager, pinned shortcuts on launcher. Support deep links for quick actions.",
    "look_for": "Understanding of shortcut types, icon handling, and integration with launcher."
  },
  {
    "id": 203,
    "level": "senior",
    "question": "What is Compose's key composable function?",
    "short_answer": "key() helps Compose identify composable instances across recompositions, maintaining state and avoiding unwanted recomposition.",
    "look_for": "Understanding of when keys are needed, especially in lists, and stable vs unstable keys."
  },
  {
    "id": 204,
    "level": "senior",
    "question": "How do you implement proper code coverage for tests?",
    "short_answer": "Use JaCoCo for coverage reporting, configure Gradle, set coverage thresholds, integrate with CI, focus on meaningful coverage over percentage.",
    "look_for": "Understanding of coverage types, configuration, and interpretation of results."
  },
  {
    "id": 205,
    "level": "senior",
    "question": "Explain Android's CameraX library.",
    "short_answer": "CameraX simplifies camera development with use cases (Preview, ImageCapture, ImageAnalysis), lifecycle awareness, and device-specific fixes.",
    "look_for": "Understanding of use cases, extensions, and migration from Camera2 API."
  },
  {
    "id": 206,
    "level": "senior",
    "question": "What is the difference between crossinline and noinline in Kotlin?",
    "short_answer": "crossinline prevents non-local returns in lambdas. noinline prevents inlining specific lambda parameters when others are inlined.",
    "look_for": "Understanding of inline function restrictions and appropriate use cases."
  },
  {
    "id": 207,
    "level": "senior",
    "question": "How do you implement proper color management and theming?",
    "short_answer": "Use Material Design theming, support light/dark themes, implement dynamic colors (Material You), use semantic color tokens, test color contrast.",
    "look_for": "Understanding of theme attributes, DayNight themes, and Material Theming system."
  },
  {
    "id": 208,
    "level": "senior",
    "question": "Explain Android's Autofill Framework.",
    "short_answer": "Autofill Framework enables password managers to fill forms. Provide hints in XML, implement AutofillService for custom solutions.",
    "look_for": "Understanding of autofill hints, save requests, and security considerations."
  },
  {
    "id": 209,
    "level": "senior",
    "question": "What is Compose's AnimatedVisibility?",
    "short_answer": "AnimatedVisibility animates showing/hiding composables with enter/exit animations, supporting custom transitions and content animations.",
    "look_for": "Understanding of enter/exit transitions, AnimatedContent difference, and animation specifications."
  },
  {
    "id": 210,
    "level": "senior",
    "question": "How do you implement proper ProGuard/R8 configuration?",
    "short_answer": "Keep rules for reflection-based libraries, preserve line numbers for crashes, optimize appropriately, test release builds, maintain proguard-rules.pro.",
    "look_for": "Understanding of keep rules, optimization levels, and troubleshooting obfuscated crashes."
  },
  {
    "id": 211,
    "level": "senior",
    "question": "Explain Android's WindowInsets and edge-to-edge display.",
    "short_answer": "WindowInsets represent system UI (status bar, nav bar). Edge-to-edge draws under system bars, requiring proper insets handling for content.",
    "look_for": "Understanding of WindowInsetsCompat, handling keyboard insets, and View.setOnApplyWindowInsetsListener."
  },
  {
    "id": 212,
    "level": "senior",
    "question": "What is Kotlin's @OptIn annotation?",
    "short_answer": "@OptIn allows using experimental or unstable APIs, requiring explicit opt-in, documenting that API might change.",
    "look_for": "Understanding of API evolution, RequiresOptIn annotation, and versioning implications."
  },
  {
    "id": 213,
    "level": "senior",
    "question": "How do you implement proper biometric authentication?",
    "short_answer": "Use BiometricPrompt API, configure authenticator types (biometric, device credential), handle success/failure callbacks, implement crypto-based authentication.",
    "look_for": "Understanding of BiometricManager, crypto operations, and fallback mechanisms."
  },
  {
    "id": 214,
    "level": "senior",
    "question": "Explain Android's Jetpack Benchmark library.",
    "short_answer": "Benchmark library measures code performance reliably, handles warmup, supports macrobenchmarks (UI) and microbenchmarks (code), outputs metrics.",
    "look_for": "Understanding of benchmark setup, interpretation of results, and comparison strategies."
  },
  {
    "id": 215,
    "level": "senior",
    "question": "What is Compose's SubcomposeLayout?",
    "short_answer": "SubcomposeLayout allows measuring children before composing them, enabling dynamic layouts based on child measurements.",
    "look_for": "Understanding of advanced layout scenarios, performance implications, and comparison with regular Layout."
  },
  {
    "id": 216,
    "level": "senior",
    "question": "How do you implement proper APK size optimization?",
    "short_answer": "Enable R8, use App Bundle, remove unused resources, compress images (WebP), use vector drawables, analyze APK, split by ABI/density.",
    "look_for": "Understanding of APK Analyzer usage, optimization techniques, and size impact measurement."
  },
  {
    "id": 217,
    "level": "senior",
    "question": "Explain Android's DownloadManager.",
    "short_answer": "DownloadManager handles long-running HTTP downloads, survives app closure, provides notifications, supports query/control of downloads.",
    "look_for": "Understanding of download requests, notification handling, and proper cleanup."
  },
  {
    "id": 218,
    "level": "senior",
    "question": "What is the difference between Mutex and Semaphore in coroutines?",
    "short_answer": "Mutex allows one coroutine to access resource at a time. Semaphore allows configurable number of concurrent accesses.",
    "look_for": "Understanding of mutual exclusion, use cases, and comparison with synchronized blocks."
  },
  {
    "id": 219,
    "level": "senior",
    "question": "How do you implement proper clipboard handling?",
    "short_answer": "Use ClipboardManager, handle ClipData with MIME types, support rich content, implement copy/paste for custom views, consider privacy.",
    "look_for": "Understanding of ClipData types, security implications of clipboard access."
  },
  {
    "id": 220,
    "level": "senior",
    "question": "Explain Android's Picture-in-Picture mode.",
    "short_answer": "PiP allows app to display in small window while user interacts with other apps. Configure aspect ratio, handle lifecycle, provide custom actions.",
    "look_for": "Understanding of PiP requirements, lifecycle implications, and user experience considerations."
  },
  {
    "id": 221,
    "level": "senior",
    "question": "What is Compose's ModalBottomSheet vs ModalDrawer?",
    "short_answer": "ModalBottomSheet slides from bottom with scrim. ModalDrawer slides from side. Both block interaction with content behind.",
    "look_for": "Understanding of use cases, implementation patterns, and Material Design guidelines."
  },
  {
    "id": 222,
    "level": "senior",
    "question": "How do you implement proper text handling and typography?",
    "short_answer": "Use TextAppearance styles, support text scaling, handle long text, implement ellipsize, support RTL, use appropriate fonts, consider accessibility.",
    "look_for": "Understanding of typography scales, font resources, and text performance optimization."
  },
  {
    "id": 223,
    "level": "senior",
    "question": "Explain Android's SyncAdapter framework.",
    "short_answer": "SyncAdapter is legacy framework for data synchronization with server accounts. Now deprecated in favor of WorkManager with appropriate constraints.",
    "look_for": "Understanding of migration path, account authenticator integration, and modern alternatives."
  },
  {
    "id": 224,
    "level": "senior",
    "question": "What is Kotlin's operator overloading?",
    "short_answer": "Operator overloading allows defining behavior for operators (+, -, *, etc.) on custom types using operator functions.",
    "look_for": "Understanding of available operators, conventions, and appropriate use cases."
  },
  {
    "id": 225,
    "level": "senior",
    "question": "How do you implement proper drag and drop?",
    "short_answer": "Use View.startDragAndDrop for drag source, implement OnDragListener for drop target, handle DragEvent actions, provide visual feedback.",
    "look_for": "Understanding of drag shadows, clip data, and cross-app drag and drop."
  },
  {
    "id": 226,
    "level": "senior",
    "question": "Explain Android's MediaStore API changes.",
    "short_answer": "Scoped storage changes require MediaStore for media access, query collections, handle pending media, implement file operations properly.",
    "look_for": "Understanding of scoped storage migration, content URI handling, and permission requirements."
  },
  {
    "id": 227,
    "level": "senior",
    "question": "What is Compose's animateContentSize?",
    "short_answer": "animateContentSize modifier automatically animates size changes of composable content, useful for expanding/collapsing views.",
    "look_for": "Understanding of animation configuration, interaction with other animations, and performance."
  },
  {
    "id": 228,
    "level": "senior",
    "question": "How do you implement proper print framework integration?",
    "short_answer": "Use PrintManager, create PrintDocumentAdapter, handle page layout, implement custom print jobs, support PDF generation.",
    "look_for": "Understanding of print preview, page layout calculation, and print job configuration."
  },
  {
    "id": 229,
    "level": "senior",
    "question": "Explain Android's Wifi and connectivity management.",
    "short_answer": "Use ConnectivityManager for network state, NetworkCallback for monitoring, WifiManager for wifi operations, handle network changes properly.",
    "look_for": "Understanding of metered networks, network capabilities, and Android 10+ restrictions."
  },
  {
    "id": 230,
    "level": "senior",
    "question": "What is the difference between atomic and volatile in concurrent programming?",
    "short_answer": "Volatile ensures visibility across threads. Atomic classes (AtomicInteger) provide atomic read-modify-write operations with compare-and-swap.",
    "look_for": "Understanding of memory visibility, happens-before relationship, and when to use each."
  },
  {
    "id": 231,
    "level": "senior",
    "question": "How do you implement proper Bluetooth integration?",
    "short_answer": "Use BluetoothAdapter for classic Bluetooth, BluetoothLeScanner for BLE, handle permissions, manage connections, implement GATT operations for BLE.",
    "look_for": "Understanding of BLE vs classic Bluetooth, permission changes across versions, and connection management."
  },
  {
    "id": 232,
    "level": "senior",
    "question": "Explain Android's Storage Access Framework.",
    "short_answer": "SAF provides unified way to access documents from various providers, use ACTION_OPEN_DOCUMENT and ACTION_CREATE_DOCUMENT intents.",
    "look_for": "Understanding of document tree access, persistent permissions, and content URI handling."
  },
  {
    "id": 233,
    "level": "senior",
    "question": "What is Compose's InfiniteTransition?",
    "short_answer": "InfiniteTransition runs animations indefinitely without stopping, useful for loading indicators or continuous animations.",
    "look_for": "Understanding of infinite animations, multiple animated values, and lifecycle considerations."
  },
  {
    "id": 234,
    "level": "senior",
    "question": "How do you implement proper sensor integration?",
    "short_answer": "Use SensorManager, register listeners with appropriate sampling rates, unregister in lifecycle callbacks, batch sensor events, handle sensor availability.",
    "look_for": "Understanding of sensor types, coordinate systems, power consumption, and data filtering."
  },
  {
    "id": 235,
    "level": "senior",
    "question": "Explain Android's Text-to-Speech engine.",
    "short_answer": "Use TextToSpeech class, initialize asynchronously, set language, configure speech parameters, handle utterance callbacks, release resources.",
    "look_for": "Understanding of language support, speech synthesis, and error handling."
  },
  {
    "id": 236,
    "level": "senior",
    "question": "What is Kotlin's type aliases?",
    "short_answer": "Type aliases create alternative names for existing types, improving code readability for complex generic types or function types.",
    "look_for": "Understanding that they don't create new types, just aliases, and appropriate use cases."
  },
  {
    "id": 237,
    "level": "senior",
    "question": "How do you implement proper NFC integration?",
    "short_answer": "Use NfcAdapter, implement foreground dispatch or intent filters, handle NDEF messages, implement peer-to-peer communication or tag reading/writing.",
    "look_for": "Understanding of NFC modes (reader, P2P, card emulation), NDEF format, and Android Beam deprecation."
  },
  {
    "id": 238,
    "level": "senior",
    "question": "Explain Android's AppSearch library.",
    "short_answer": "AppSearch provides on-device full-text search, supports indexing app data, complex queries, ranking, and sharing data across apps.",
    "look_for": "Understanding of schema definition, search implementation, and comparison with Room FTS."
  },
  {
    "id": 239,
    "level": "senior",
    "question": "What is Compose's Crossfade?",
    "short_answer": "Crossfade animates switching between different content with fade animation, useful for simple content transitions.",
    "look_for": "Understanding of content keys, animation duration, and comparison with AnimatedContent."
  },
  {
    "id": 240,
    "level": "senior",
    "question": "How do you implement proper geofencing?",
    "short_answer": "Use Geofencing API, define GeofenceRequest with transition types, implement GeofencingClient, handle intents in BroadcastReceiver or Service.",
    "look_for": "Understanding of geofence lifecycle, battery considerations, and accuracy limitations."
  },
  {
    "id": 241,
    "level": "senior",
    "question": "Explain Android's ML Kit and on-device machine learning.",
    "short_answer": "ML Kit provides ready-to-use ML APIs (text recognition, face detection, etc.), supports custom TensorFlow Lite models, runs on-device.",
    "look_for": "Understanding of bundled vs unbundled models, model deployment, and inference optimization."
  },
  {
    "id": 242,
    "level": "senior",
    "question": "What is the difference between SharedFlow and BroadcastChannel?",
    "short_answer": "BroadcastChannel is deprecated. SharedFlow is its replacement, offering more configuration, better integration with Flow API.",
    "look_for": "Understanding of migration path and SharedFlow advantages."
  },
  {
    "id": 243,
    "level": "senior",
    "question": "How do you implement proper barcode scanning?",
    "short_answer": "Use ML Kit Barcode Scanning, CameraX for camera feed, process frames, handle different barcode formats, provide visual feedback.",
    "look_for": "Understanding of supported formats, real-time processing, and error handling."
  },
  {
    "id": 244,
    "level": "senior",
    "question": "Explain Android's Health Connect API.",
    "short_answer": "Health Connect provides centralized health and fitness data platform, allows apps to read/write health data with user permission.",
    "look_for": "Understanding of data types, permissions, and integration with health apps."
  },
  {
    "id": 245,
    "level": "senior",
    "question": "What is Compose's Scaffold component?",
    "short_answer": "Scaffold provides Material Design layout structure with slots for TopAppBar, BottomBar, FAB, Drawer, and SnackbarHost.",
    "look_for": "Understanding of slot API, coordinate app bar with content, and state management."
  },
  {
    "id": 246,
    "level": "senior",
    "question": "How do you implement proper speech recognition?",
    "short_answer": "Use SpeechRecognizer API, request RECORD_AUDIO permission, handle recognition results, implement error handling, provide UI feedback.",
    "look_for": "Understanding of continuous recognition, offline vs online recognition, and result confidence."
  },
  {
    "id": 247,
    "level": "senior",
    "question": "Explain Android's Privacy Sandbox.",
    "short_answer": "Privacy Sandbox provides privacy-preserving APIs for ads (Topics API, FLEDGE, Attribution Reporting) replacing tracking identifiers.",
    "look_for": "Understanding of privacy implications, API integration, and migration from advertising ID."
  },
  {
    "id": 248,
    "level": "senior",
    "question": "What is Kotlin's tailrec modifier?",
    "short_answer": "tailrec optimizes tail-recursive functions into loops, preventing stack overflow for deep recursion.",
    "look_for": "Understanding of tail call optimization, requirements for tail recursion, and use cases."
  },
  {
    "id": 249,
    "level": "senior",
    "question": "How do you implement proper VPN integration?",
    "short_answer": "UseVpnService, establish VPN connection, handle routing, implement packet forwarding, maintain connection state.",
    "look_for": "Understanding of VPN architecture, packet handling, and Android VPN requirements."
  },
  {
    "id": 250,
    "level": "senior",
    "question": "Explain Android's Custom Tabs.",
    "short_answer": "Custom Tabs provide lightweight browser experience within app, pre-warming, custom UI colors, share menu, faster than WebView.",
    "look_for": "Understanding of CustomTabsIntent, session management, and fallback to browser."
  },
  {
    "id": 251,
    "level": "senior",
    "question": "What is Compose's LazyColumn vs Column with Modifier.verticalScroll?",
    "short_answer": "LazyColumn composes items lazily (only visible items), efficient for large lists. Column composes all items, suitable for small fixed content.",
    "look_for": "Understanding of composition performance, when to use each, and memory implications."
  },
  {
    "id": 252,
    "level": "senior",
    "question": "How do you implement proper app widgets?",
    "short_answer": "Create AppWidgetProvider, define widget layout, configure update frequency, handle click events via PendingIntents, support different sizes.",
    "look_for": "Understanding of RemoteViews limitations, update strategies, and Android 12+ improvements."
  },
  {
    "id": 253,
    "level": "senior",
    "question": "Explain Android's Nearby Connections API.",
    "short_answer": "Nearby Connections provides P2P communication without internet, supports WiFi Direct, Bluetooth, discovery, and connection management.",
    "look_for": "Understanding of connection strategies, data transfer patterns, and offline communication."
  },
  {
    "id": 254,
    "level": "senior",
    "question": "What is the difference between MediatorLiveData and Transformations.switchMap?",
    "short_answer": "MediatorLiveData observes multiple LiveData sources. switchMap transforms one LiveData to another, canceling previous observation.",
    "look_for": "Understanding of use cases, multiple source handling, and migration to Flow."
  },
  {
    "id": 255,
    "level": "senior",
    "question": "How do you implement proper contacts integration?",
    "short_answer": "Use ContactsContract, request READ_CONTACTS permission, query contacts properly, handle aggregated contacts, display contact picker.",
    "look_for": "Understanding of contact data structure, RawContacts vs Contacts, and efficient querying."
  },
  {
    "id": 256,
    "level": "senior",
    "question": "Explain Android's Chrome Custom Tabs vs Trusted Web Activity.",
    "short_answer": "Custom Tabs show browser chrome. TWA displays web app in fullscreen without browser UI, requires Digital Asset Links verification.",
    "look_for": "Understanding of PWA integration, verification process, and use cases."
  },
  {
    "id": 257,
    "level": "senior",
    "question": "What is Compose's BoxWithConstraints?",
    "short_answer": "BoxWithConstraints provides constraints (maxWidth, maxHeight) to child composables, enabling responsive layouts based on available space.",
    "look_for": "Understanding of constraints access, responsive design patterns, and performance considerations."
  },
  {
    "id": 258,
    "level": "senior",
    "question": "How do you implement proper location services with FusedLocationProvider?",
    "short_answer": "Use FusedLocationProviderClient, request location permissions, configure location request parameters, handle location updates, implement geofencing.",
    "look_for": "Understanding of location accuracy, battery optimization, and background location restrictions."
  },
  {
    "id": 259,
    "level": "senior",
    "question": "Explain Android's accompanist libraries.",
    "short_answer": "Accompanist provides supplementary Compose libraries (permissions, system UI controller, pager, navigation animation) filling gaps in Jetpack Compose.",
    "look_for": "Understanding of available libraries, migration to official Compose equivalents, and deprecation status."
  },
  {
    "id": 260,
    "level": "senior",
    "question": "What is Kotlin's expect/actual mechanism?",
    "short_answer": "expect/actual allows declaring platform-agnostic API (expect) with platform-specific implementations (actual) for multiplatform projects.",
    "look_for": "Understanding of multiplatform architecture, use cases, and limitations."
  },
  {
    "id": 261,
    "level": "senior",
    "question": "How do you implement proper calendar and event integration?",
    "short_answer": "Use CalendarContract, request CALENDAR permissions, query calendars and events, insert/update events, handle recurrence rules.",
    "look_for": "Understanding of calendar provider structure, attendees handling, and reminders."
  },
  {
    "id": 262,
    "level": "senior",
    "question": "Explain Android's Performance monitoring tools.",
    "short_answer": "Use Android Profiler (CPU, memory, network), Systrace/Perfetto, StrictMode, Macrobenchmark for UI, Firebase Performance Monitoring.",
    "look_for": "Understanding of profiling workflow, bottleneck identification, and metrics interpretation."
  },
  {
    "id": 263,
    "level": "senior",
    "question": "What is Compose's SideEffect composable?",
    "short_answer": "SideEffect runs after every successful recomposition, useful for publishing Compose state to non-Compose code.",
    "look_for": "Understanding of execution timing, use cases, and comparison with LaunchedEffect."
  },
  {
    "id": 264,
    "level": "senior",
    "question": "How do you implement proper in-app purchases?",
    "short_answer": "Use Google Play Billing Library, query products, initiate purchase flow, verify purchases, consume/acknowledge, handle subscriptions.",
    "look_for": "Understanding of product types, server-side verification, and subscription management."
  },
  {
    "id": 265,
    "level": "senior",
    "question": "Explain Android's App Links verification.",
    "short_answer": "Digital Asset Links verification proves domain ownership, enabling direct app opening from verified URLs without disambiguation dialog.",
    "look_for": "Understanding of assetlinks.json file, intent filter configuration, and testing verification."
  },
  {
    "id": 266,
    "level": "senior",
    "question": "What is the difference between produce and flow builder?",
    "short_answer": "produce creates Channel (hot), flow builder creates cold Flow. Channel sends to multiple receivers, Flow is unicast.",
    "look_for": "Understanding of hot vs cold streams, appropriate use cases, and performance implications."
  },
  {
    "id": 267,
    "level": "senior",
    "question": "How do you implement proper SMS and phone integration?",
    "short_answer": "Use SMS Retriever API for one-tap verification, TelephonyManager for phone state, ACTION_DIAL for dialing, handle runtime permissions.",
    "look_for": "Understanding of SMS permissions changes, user verification best practices, and alternative approaches."
  },
  {
    "id": 268,
    "level": "senior",
    "question": "Explain Android's MediaProjection API.",
    "short_answer": "MediaProjection captures screen content for recording or casting, requires user consent via MediaProjectionManager, handles VirtualDisplay.",
    "look_for": "Understanding of screen capture setup, privacy implications, and recording implementation."
  },
  {
    "id": 269,
    "level": "senior",
    "question": "What is Compose's DisposableEffect use cases?",
    "short_answer": "DisposableEffect registers observers/listeners that need cleanup, calls onDispose when effect leaves composition or key changes.",
    "look_for": "Understanding of resource cleanup, lifecycle observation, and proper key usage."
  },
  {
    "id": 270,
    "level": "senior",
    "question": "How do you implement proper file encryption?",
    "short_answer": "Use Android Keystore for key management, EncryptedFile/EncryptedSharedPreferences from Security Crypto library, or implement custom AES encryption.",
    "look_for": "Understanding of encryption algorithms, key management, and AndroidKeyStore security."
  },
  {
    "id": 271,
    "level": "senior",
    "question": "Explain Android's Device-to-Device communication patterns.",
    "short_answer": "Options include Bluetooth, WiFi Direct, Nearby Connections, NFC, and Firebase Cloud Messaging for server-mediated communication.",
    "look_for": "Understanding of trade-offs (range, setup, bandwidth), appropriate protocol selection."
  },
  {
    "id": 272,
    "level": "senior",
    "question": "What is Kotlin's @BuilderInference?",
    "short_answer": "@BuilderInference enables type inference for generic builders, improving DSL ergonomics by inferring types from builder lambda.",
    "look_for": "Understanding of type inference scope, DSL design, and appropriate usage."
  },
  {
    "id": 273,
    "level": "senior",
    "question": "How do you implement proper push notification handling?",
    "short_answer": "Use Firebase Cloud Messaging, handle data/notification messages, implement notification channels, handle background restrictions, track delivery.",
    "look_for": "Understanding of message types, background processing limitations, and notification best practices."
  },
  {
    "id": 274,
    "level": "senior",
    "question": "Explain Android's ViewModel SavedStateHandle.",
    "short_answer": "SavedStateHandle survives process death, stores key-value data, provides LiveData/StateFlow access, integrates with Navigation arguments.",
    "look_for": "Understanding of state restoration, process death handling, and integration patterns."
  },
  {
    "id": 275,
    "level": "senior",
    "question": "What is Compose's remember with calculation?",
    "short_answer": "remember with calculation key recomputes value when key changes, useful for derived state based on other state.",
    "look_for": "Understanding of key-based recomputation, comparison with derivedStateOf, and performance implications."
  },
  {
    "id": 276,
    "level": "senior",
    "question": "How do you implement proper CI/CD for Android?",
    "short_answer": "Use GitHub Actions/Jenkins/CircleCI, automate builds, run tests, lint checks, deploy to Play Store, manage signing keys securely.",
    "look_for": "Understanding of pipeline setup, artifact management, and deployment automation."
  },
  {
    "id": 277,
    "level": "senior",
    "question": "Explain Android's WakeLock and battery optimization.",
    "short_answer": "WakeLock keeps device awake for critical operations, must be released promptly. Use Doze exemption carefully, prefer WorkManager for deferred work.",
    "look_for": "Understanding of battery impact, permission requirements, and alternatives."
  },
  {
    "id": 278,
    "level": "senior",
    "question": "What is the difference between viewModelScope and lifecycleScope?",
    "short_answer": "viewModelScope tied to ViewModel lifecycle, cancelled when ViewModel cleared. lifecycleScope tied to lifecycle owner (Activity/Fragment), cancelled when destroyed.",
    "look_for": "Understanding of scope lifecycle, appropriate usage, and cancellation behavior."
  },
  {
    "id": 279,
    "level": "senior",
    "question": "How do you implement proper audio recording and playback?",
    "short_answer": "Use AudioRecord for recording, AudioTrack for playback, request RECORD_AUDIO permission, handle audio focus, support different sample rates/formats.",
    "look_for": "Understanding of audio formats, buffer management, and audio focus handling."
  },
  {
    "id": 280,
    "level": "senior",
    "question": "Explain Android's Firebase Remote Config strategies.",
    "short_answer": "Remote Config enables A/B testing, gradual rollouts, server-side feature flags. Use conditions, personalization, and proper defaults.",
    "look_for": "Understanding of config strategies, cache management, and real-time updates."
  },
  {
    "id": 281,
    "level": "senior",
    "question": "What is Compose's Layout composable?",
    "short_answer": "Layout is the fundamental composable for custom layouts, provides measure and placement control for children.",
    "look_for": "Understanding of measurement policy, custom layout implementation, and intrinsic measurements."
  },
  {
    "id": 282,
    "level": "senior",
    "question": "How do you implement proper video recording?",
    "short_answer": "Use CameraX VideoCapture, MediaRecorder, or MediaCodec for advanced control. Handle permissions, storage, quality settings, and orientation.",
    "look_for": "Understanding of encoding formats, quality vs size trade-offs, and camera lifecycle."
  },
  {
    "id": 283,
    "level": "senior",
    "question": "Explain Android's Play Feature Delivery.",
    "short_answer": "Play Feature Delivery splits app into modules delivered on-demand, conditional, or at install, reducing initial download size.",
    "look_for": "Understanding of delivery modes, SplitInstallManager, and feature module configuration."
  },
  {
    "id": 284,
    "level": "senior",
    "question": "What is Kotlin's suspend function transformation?",
    "short_answer": "Compiler transforms suspend functions into state machines with Continuation parameter, enabling suspension and resumption without blocking threads.",
    "look_for": "Understanding of CPS transformation, Continuation interface, and performance characteristics."
  },
  {
    "id": 285,
    "level": "senior",
    "question": "How do you implement proper QR code generation?",
    "short_answer": "Use ZXing library, encode data to QR format, render to Bitmap, handle different error correction levels and sizes.",
    "look_for": "Understanding of QR code formats, error correction, and display optimization."
  },
  {
    "id": 286,
    "level": "senior",
    "question": "Explain Android's Photo Picker API.",
    "short_answer": "Photo Picker (Android 11+) provides privacy-preserving media selection without requiring storage permissions, consistent UI across devices.",
    "look_for": "Understanding of permission benefits, multi-select support, and fallback strategies."
  },
  {
    "id": 287,
    "level": "senior",
    "question": "What is Compose's Modifier.drawWithCache?",
    "short_answer": "drawWithCache caches drawing operations, rebuilding cache only when size or dependencies change, optimizing custom drawing performance.",
    "look_for": "Understanding of drawing optimization, cache invalidation, and comparison with drawBehind."
  },
  {
    "id": 288,
    "level": "senior",
    "question": "How do you implement proper rate limiting?",
    "short_answer": "Implement token bucket or leaky bucket algorithm, track request timestamps, use RxJava throttle/debounce or Flow operators, handle API rate limits.",
    "look_for": "Understanding of rate limiting algorithms, backoff strategies, and user experience considerations."
  },
  {
    "id": 289,
    "level": "senior",
    "question": "Explain Android's Permissions best practices.",
    "short_answer": "Request permissions in context, explain rationale, handle denial gracefully, use least privilege, request runtime permissions at appropriate time.",
    "look_for": "Understanding of permission UX, shouldShowRequestPermissionRationale, and granular permissions."
  },
  {
    "id": 290,
    "level": "senior",
    "question": "What is the difference between Channel and SharedFlow buffer strategies?",
    "short_answer": "Channel buffers with capacity, overflow strategies (suspend, drop). SharedFlow has replay and buffer with overflow strategies (suspend, drop oldest/latest).",
    "look_for": "Understanding of backpressure handling, appropriate buffer configuration, and use cases."
  },
  {
    "id": 291,
    "level": "senior",
    "question": "How do you implement proper video streaming?",
    "short_answer": "Use ExoPlayer with adaptive streaming (DASH, HLS), implement caching, handle DRM, provide playback controls, optimize buffering strategy.",
    "look_for": "Understanding of streaming protocols, buffer management, and quality adaptation."
  },
  {
    "id": 292,
    "level": "senior",
    "question": "Explain Android's App Compatibility and AndroidX migration.",
    "short_answer": "AndroidX replaces Support Library with consistent packaging, independent versioning. Migrate using Android Studio refactoring tools.",
    "look_for": "Understanding of migration process, Jetifier for dependencies, and version management."
  },
  {
    "id": 293,
    "level": "senior",
    "question": "What is Compose's GraphicsLayer modifier?",
    "short_answer": "GraphicsLayer enables hardware-accelerated transformations (rotation, scale, alpha) with optional caching, improving animation performance.",
    "look_for": "Understanding of layer caching benefits, transformation compositing, and performance impact."
  },
  {
    "id": 294,
    "level": "senior",
    "question": "How do you implement proper OAuth2 authentication?",
    "short_answer": "Use AppAuth library, implement authorization code flow with PKCE, store tokens securely, handle token refresh, implement logout.",
    "look_for": "Understanding of OAuth2 flows, token security, and secure storage practices."
  },
  {
    "id": 295,
    "level": "senior",
    "question": "Explain Android's Google Play services and Play Core library.",
    "short_answer": "Google Play services provides APIs for Google services. Play Core library handles app updates, feature modules, in-app reviews.",
    "look_for": "Understanding of dependency management, availability checking, and feature implementations."
  },
  {
    "id": 296,
    "level": "senior",
    "question": "What is Kotlin's builder type inference?",
    "short_answer": "Builder type inference infers generic types from builder lambda body, avoiding explicit type parameters in DSL-style builders.",
    "look_for": "Understanding of DSL design, type inference scope, and limitations."
  },
  {
    "id": 297,
    "level": "senior",
    "question": "How do you implement proper image cropping?",
    "short_answer": "Use uCrop library or implement custom crop view, handle aspect ratios, provide zoom/pan, save cropped result efficiently.",
    "look_for": "Understanding of bitmap manipulation, memory management, and output quality."
  },
  {
    "id": 298,
    "level": "senior",
    "question": "Explain Android's Privacy Dashboard and indicators.",
    "short_answer": "Privacy Dashboard (Android 12+) shows permission usage. Privacy indicators show camera/microphone access. Apps must handle transparency.",
    "look_for": "Understanding of privacy requirements, attribution tags, and user transparency."
  },
  {
    "id": 299,
    "level": "senior",
    "question": "What is Compose's PointerInput modifier?",
    "short_answer": "PointerInput detects gestures and touch events, provides low-level touch handling, supports custom gestures.",
    "look_for": "Understanding of gesture detection, touch event handling, and existing gesture detectors."
  },
  {
    "id": 300,
    "level": "senior",
    "question": "How do you implement proper app signing and key management?",
    "short_answer": "Use Android Keystore for signing keys, implement Play App Signing, protect keystore files, set up key rotation, maintain backup keys.",
    "look_for": "Understanding of signing configurations, Play App Signing benefits, and security best practices."
  }
]